# Set

In [1]:
#unordered #unchangeable # duplicates not allowed
set1 = {1,2,3,4, 'ai'}

In [2]:
10 in set1 #to know if any data is in the set or not

False

In [2]:
set1 = {1,2,3,4,5}
set2 = {2,3,4,6,7}

In [3]:
set2.add(8)

In [4]:
set2

{2, 3, 4, 6, 7, 8}

In [5]:
set2.remove(8)

In [7]:
set1.pop() #to remove the first item

1

In [ ]:
set2.clear() #to remove whole set

In [8]:
set1

{2, 3, 4, 5}

In [9]:
set1.union(set2)

{2, 3, 4, 5, 8}

In [12]:
set1 | set2 #union

{2, 3, 4, 5, 8}

In [10]:
set3 = {2,7,8,1}

In [11]:
set1.intersection(set2,set3)

{2}

In [17]:
set1.update(set2)

In [18]:
set1

{1, 2, 3, 4, 5, 6, 7}

# Dictionary{}

In [6]:
#ordered #changeable #no duplicates #uses key
D1 = {"brand": "Apple",
     "model": "pro max",
     "year": 2020,
     1: [1,2,3,4,5]}

In [7]:
D1['model']

'pro max'

In [23]:
D1[1]

[1, 2, 3, 4, 5]

In [24]:
D1.get("year")

2020

In [27]:
D1[1] = 100

In [28]:
D1

{'brand': 'Apple', 'model': 'pro max', 'year': 2020, 1: 100}

In [18]:
D1['price'] = '$1200'

In [20]:
value = D1.pop('Price') #to remove from dictionaries

In [21]:
D1

{'brand': 'Apple',
 'model': 'pro max',
 'year': 2020,
 1: [1, 2, 3, 4, 5],
 'price': '$1200'}

In [22]:
for i in D1:
    print(i)

brand
model
year
1
price

In [23]:
for i in D1:
    print(D1[i])

Apple
pro max
2020
[1, 2, 3, 4, 5]
$1200

In [ ]:
!pip install pandas
!pip install numpy

# Pandas

In [35]:
import pandas as pd

In [36]:
l1 = ['Data Science', 'IT', 'Ai', 'Computer Science']

In [37]:
df = pd.DataFrame(l1)

In [38]:
df.shape

(4, 1)

In [39]:
df

                  0
0      Data Science
1                IT
2                Ai
3  Computer Science

In [40]:
data = {'Name':['Oishy','Sadia','Selim','Saleh','Muzammil'],
        'Age':[23,26,28,27,25]
       }

In [41]:
df = pd.DataFrame(data)

In [42]:
df

       Name  Age
0     Oishy   23
1     Sadia   26
2     Selim   28
3     Saleh   27
4  Muzammil   25

In [43]:
import numpy as np

In [48]:
data1 = {'Name':['Oishy','Sadia','Selim',np.nan,'Muzammil'],
        'Age':[23,26,28,27,25]
       }

In [49]:
df = pd.DataFrame(data1)

In [50]:
df

       Name  Age
0     Oishy   23
1     Sadia   26
2     Selim   28
3       NaN   27
4  Muzammil   25

In [51]:
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False  False
3   True  False
4  False  False

In [53]:
df.isnull().sum()

Name    1
Age     0
dtype: int64

In [54]:
df['Age'].mean()

25.8